{"data":{"site":{"siteMetadata":{"title":"Final Year Research Log","author":"William Park"}},"markdownRemark":{"id":"32efa764-e9f2-559e-9d7b-0e465e80a068","excerpt":"Today I launched a couple of online surveys in order to learn a few things about people habits, and their interest in the app. I asked about…","html":"<p>Today I launched a couple of online surveys in order to learn a few things about people habits, and their interest in the app. I asked about peoples habits to see where people they struggle. This will be helpful if I decide to narrow the focus of the application. I had around 100 participents in total.</p>\n<p>In this post, I’m going to talk about each survey, what I learned from the initial results, and what I could have done better.</p>\n<h2>Small-scale survey shared via social media</h2>\n<p>I launched a survey through a couple of my social media channels and also on Reddit to gather information.</p>\n<p>The replies here were detailed and informative. However, it was tough to get people to do the survey. From the initial results, it looks like most people would be interested in an application that worked as a habit diary, that has extra features to help motivate them. </p>\n<p>There’s a conflict about whether notifications would be a good thing, with some people finding them annoying, but others found them a helpful reminder.</p>\n<p>One particularly interesting reply to the question about if they would use the app was:</p>\n<p>“Depends. Normally I have trouble because using a habit tracker requires making another habit: using it.”</p>\n<p>I hope this won’t be too much of an issue, as the research I’m doing to help hook people into keeping a habit by using the app should also apply to hook people into using the app as a habit. However, it makes researching this all the more important.</p>\n<h2>Large-scale paid “worker” survey</h2>\n<p>I used one of Amazon’s services called mTurk to “purchase” survey results. For only a few pounds I was able to get 76 participents to do the survey. The reason I went for this option was because I wanted to see if anonymous responses would show different trends.</p>\n<p>Answers here were generally low-effort and only few went into detail. However, I do have more data here and was able to find some trends.</p>\n<p>When asked what their positive habits were, people usually mentioned one of these 3 things:</p>\n<ul>\n<li>Excercise</li>\n<li>Time keeping</li>\n<li>Healthy eating</li>\n</ul>\n<p>When asked what their negative habits were, there was a wider range of replies: </p>\n<ul>\n<li>Smoking</li>\n<li>Procrastination</li>\n<li>Negative self thinking</li>\n<li>Drug usage</li>\n<li>Gambling</li>\n<li>Anger issues</li>\n</ul>\n<p>There’s a couple of points from the negative data that I want to touch on. I hadn’t considered that I may be tackling the realm of addiction with this app. This is an area I should research in addition to habits. Secondly, I now realise that I may want to focus on breaking bad habits, rather than building good ones.</p>\n<p>When I broke the data to examine what age range I should aim for (by comparing age ranges, to app interest) I found that the range 25-34 wins by a long shot, with 41.67% of people saying they would try it. The next highest range was 18-24 at 19.44%. This lines up with what I generally expected.</p>\n<p>If I were to do this again I would focus on smaller questions that are picked up by comparision and analysis tools to help identify more patterns.</p>\n<p>You can view the results from the large scale survey here:\n<a href=\"https://www.surveymonkey.com/results/SM-KP2QZ7R6L/\">https://www.surveymonkey.com/results/SM-KP2QZ7R6L/</a></p>","frontmatter":{"title":"User Surveys Launched","date":"October 07, 2018"}}},"pageContext":{"slug":"/user-surveys/","previous":{"fields":{"slug":"/research-plan/"},"frontmatter":{"title":"Research Plan"}},"next":{"fields":{"slug":"/user-research/"},"frontmatter":{"title":"User Research"}}}}