{"data":{"site":{"siteMetadata":{"title":"Final Year Research Log","author":"William Park"}},"markdownRemark":{"id":"5b410894-7003-52ec-bac2-eec64ab026ff","excerpt":"I started the process of building a logo for the project. I’m going to take you through the process of each iteration and what I was…","html":"<p>I started the process of building a logo for the project. I’m going to take you through the process of each iteration and what I was thinking at each point.</p>\n<p><img src=\"./001.png\" alt=\"Typography\"></p>\n<p>This iteration was just to get something down on the page to work with. You can see that I already have the soft font in here. I had the dotted underline pattern to indicate “beats” to try convey the tagline without using the tagline. No colours or anything, just something straight to the page.</p>\n<p><img src=\"./002.png\" alt=\"Typography\"></p>\n<p>Experimenting with colour now, because I thought it was going to be important to visualise what I wanted from the logo, and it also worked way nicer with the type. I’ve got the tagline in now because the dots weren’t doing it for me.</p>\n<p><img src=\"./003.png\" alt=\"Typography\"></p>\n<p>Adding some contrast with colours between the tagline and wordmark as I thought it all blended together too much with the single colour scheme.</p>\n<p><img src=\"./004.png\" alt=\"Typography\"></p>\n<p>Changing up some colour here to experiment. At this point I was getting unsure about the previous playful colours. Pink and blue combined makes me think about genders instantly which wasn’t what I wanted.</p>\n<p><img src=\"./005.png\" alt=\"Typography\"></p>\n<p>At this point I started thinking that the logo was just very bland. I blame the boring purple-black for that now, but I thought it was the typeface in the wordmark, so I went a bit wild.</p>\n<p><img src=\"./006.png\" alt=\"Typography\"></p>\n<p>Maybe too wild, so I toned it down. But still not the style I was looking for. Started coming back to the realisation that I liked the soft font style more.</p>\n<p><img src=\"./007.png\" alt=\"Typography\"></p>\n<p>I went searching for a new typeface that had the softer edges but also had a bit more presence. I found Fredoka One which fit that bill perfectly. At this point I knew I was happy with the typefaces, and that it must be the colours that were off.</p>\n<p><img src=\"./008.png\" alt=\"Typography\"></p>\n<p>I felt like the previous purple-black colour was overpowering with the new thicker typeface. I brought it back to a playful pink colour, then moved the use of that purple-black down to the tagline. I feel like this hit the balance I was looking for.</p>","frontmatter":{"title":"Logo Generation","date":"November 17, 2018"}}},"pageContext":{"slug":"/colours/","previous":{"fields":{"slug":"/brand-name-gen/"},"frontmatter":{"title":"Brand Name Generation - Habeats"}},"next":{"fields":{"slug":"/logo-gen/"},"frontmatter":{"title":"Logo Generation"}}}}