{"data":{"site":{"siteMetadata":{"title":"Final Year Research Log","author":"William Park"}},"markdownRemark":{"id":"89f54345-84fd-56ec-a3f9-d3d76768ac76","excerpt":"This is an outline for areas I plan to research, and how I plan to do the research. Gamification Gamification will be an important area to…","html":"<p>This is an outline for areas I plan to research, and how I plan to do the research.</p>\n<h2>Gamification</h2>\n<p>Gamification will be an important area to research, as the app will rely on it to create hooks that keep people coming back to the app. I plan to research this by researching more into Ocyalysis (I already have some experience with it from work). I’m going to look into other apps that use gamification to hook people and find out if it could be applied to what I’m doing.</p>\n<h2>Motivation</h2>\n<p>Knowing what motivates people and how the brain works when it comes to getting motivated will be something that requires a lot of focus. I’m going to look at the psychology behind motivation, and research the two different types of motivation (intrinsic &#x26; extrinsic).</p>\n<p>After learning the psychology, I’ll move onto research into how to motivate through the use of UI. </p>\n<p>I would like to launch a survey online or talk to several people about what motivates them.</p>\n<h2>Habits</h2>\n<p>I’m going to look into the psychology behind what a habit really is. I’m going to look into how people have formed habits, good and bad, and how they’ve got out of them. I’m going to look at similar software like Habitica and see what they do to form habits. I’ve already bought Hooked by Nir Eyal and I’ll be reading it to see how I can get people hooked on my app. If I can get people hooked on my app, and my app gets them hooked to building habits, I’ll be doing well. </p>\n<p>I’ll also try to get a survey launched online and talk to people about their habits and what motivates them to keep to them.</p>\n<h2>Target Audience</h2>\n<p>I’m going to look into who exactly would use an app like this. Should I be targeting a specific age group? When do people start getting concerned about their habits enough to want to correct them? </p>\n<p>I’ll be putting together user personas to help me understand who my users would be. I’ll also analyise use cases for the app in doing this.</p>\n<p>One-on-one “interviews” about this subject will be helpful as I can learn from people who would want to use this app, and from people who wouldn’t want to use the app.</p>\n<p>I’ll also put together an online survey to narrow down who I should focus on.</p>\n<h2>Community</h2>\n<p>I want to put some focus on researching how to build a community. I personally think a strong way to motivate people will be to make them feel like they’re part of community. A community that people can share their successes with. </p>","frontmatter":{"title":"Research Plan","date":"October 04, 2018"}}},"pageContext":{"slug":"/research-plan/","previous":{"fields":{"slug":"/what-is-this/"},"frontmatter":{"title":"Welcome"}},"next":{"fields":{"slug":"/project-outline/"},"frontmatter":{"title":"The Project Outline"}}}}