{"data":{"site":{"siteMetadata":{"title":"Final Year Research Log","description":"A scrapbook of research for William Park's final project"}},"allMarkdownRemark":{"edges":[{"node":{"excerpt":"I started the process of building a logo for the project. words words words words words words words words words","fields":{"slug":"/logo-gen/"},"frontmatter":{"date":"16 November, 2018","title":"Logo Generation"}}},{"node":{"excerpt":"I’ve been trying to come up with a name for my application, and I used a spider diagram to get a lot of words onto a page that I could mess…","fields":{"slug":"/brand-name-gen/"},"frontmatter":{"date":"10 November, 2018","title":"Brand Name Generation - Habeats"}}},{"node":{"excerpt":"As previously mentioned in my moodboard post, I want the feel for the app to be soft and playful. I selected the Visby Round CF typeface…","fields":{"slug":"/typography/"},"frontmatter":{"date":"07 November, 2018","title":"Typography"}}},{"node":{"excerpt":"I’ve developed a moodboard indicative of the style I want to go towards for my app. I want my app to be playful and soft, without coming…","fields":{"slug":"/moodboard/"},"frontmatter":{"date":"05 November, 2018","title":"Moodboard"}}},{"node":{"excerpt":"I’ve been giving some thought into the pricing structure I want to use for my app. I’ve chosen that I’d like to make the app cost a small…","fields":{"slug":"/pricing/"},"frontmatter":{"date":"03 November, 2018","title":"Pricing"}}},{"node":{"excerpt":"I’ve been researching gamification, and using what I already know about Octalysis from my time working at “Yomo”. I plan to use gamification…","fields":{"slug":"/gamification/"},"frontmatter":{"date":"30 October, 2018","title":"Gamification"}}},{"node":{"excerpt":"There are a few other apps I have took a look at because either I’m aware that they’ll be direct competition, or information from people…","fields":{"slug":"/competition/"},"frontmatter":{"date":"25 October, 2018","title":"Competition"}}},{"node":{"excerpt":"I’ve developed a couple of user personas. These are people who I expect would enjoy an app that lets them build good habits and get rid of…","fields":{"slug":"/user-personas/"},"frontmatter":{"date":"18 October, 2018","title":"User Personas"}}},{"node":{"excerpt":"I’ve been digging into the data I got from my user surveys and also taking into account some information I’ve gathered about chatting to…","fields":{"slug":"/user-research/"},"frontmatter":{"date":"15 October, 2018","title":"User Research"}}},{"node":{"excerpt":"Today I launched a couple of online surveys in order to learn a few things about people habits, and their interest in the app. I asked about…","fields":{"slug":"/user-surveys/"},"frontmatter":{"date":"07 October, 2018","title":"User Surveys Launched"}}},{"node":{"excerpt":"This is an outline for areas I plan to research, and how I plan to do the research. Gamification Gamification will be an important area to…","fields":{"slug":"/research-plan/"},"frontmatter":{"date":"05 October, 2018","title":"Research Plan"}}},{"node":{"excerpt":"Project Overview Some people are creatures by habit, and some people struggle to keep habits. A habit, by definition, is something that you…","fields":{"slug":"/project-outline/"},"frontmatter":{"date":"04 October, 2018","title":"The Project Outline"}}},{"node":{"excerpt":"Hello there. This is a blog owned by William Park, a student of Interaction Design, taught at Belfast School of Art. What is this blog? This…","fields":{"slug":"/what-is-this/"},"frontmatter":{"date":"03 October, 2018","title":"Welcome"}}}]}},"pageContext":{}}