{"data":{"site":{"siteMetadata":{"title":"Final Year Research Log","author":"William Park"}},"markdownRemark":{"id":"e8231900-b7d4-55ef-af5a-41a384e1afe2","excerpt":"Project Overview Some people are creatures by habit, and some people struggle to keep habits. A habit, by definition, is something that you…","html":"<h2>Project Overview</h2>\n<p>Some people are creatures by habit, and some people struggle to keep habits. A habit, by definition, is something that you do often and regularly. This means forming a habit is no easy task without repeated focus. The problem is this repeated focus to build a habit can be hard to keep if you’re forgetful, busy, or even lazy.</p>\n<p>This app will aim to use gamification hooks to pull people back to the repeated focus of creating their habit until the habit exists and fuels itself. Currently, my idea involves users earning virtual currency (but not crypto!) for keeping to their habits and spending that currency on rewards that users set up themselves. (But there’s no reason this couldn’t be expanded later to allow users to earn real rewards, like <a href=\"https://itunes.apple.com/gb/app/sweatcoin-sweat-for-coin/id971023427?mt=8\">Sweatcoin</a>). For example, if you kept to your diet habit 6 days a week, on the 7th day you can unlock a reward that allows you to treat yourself to a take-away. Of course, you could buy a take-away without that - but shame on that user!</p>\n<h4>Pros:</h4>\n<ul>\n<li>It will be interesting to apply gamification techniques to something that isn’t really a game.</li>\n<li>It’s something that would help drive me personally. And I’m sure could help other people.</li>\n<li>The potential to grow the idea into something like Sweatcoin, where you partner with businesses to offer rewards.</li>\n<li>Potential for online interactivity (leaderboards, etc)</li>\n</ul>\n<h4>Cons:</h4>\n<ul>\n<li>Will depend heavily on gamification. If it’s applied wrong, the app will fail.</li>\n<li>Has been done before. See <a href=\"https://habitica.com/\">Habitica</a>, but I personally think it’s really heavy handed with turning habits into a game and I think there’s potential in simplifying this idea.</li>\n<li>Useful on mobile, but only have resources to create on Android.</li>\n</ul>\n<h2>How might it be built?</h2>\n<p>This would work best if you can access the application at any time. So I believe native iOS &#x26; Android would be best.  I would use React Native to build the UI, and Firebase to store user data. To aid with building a smooth experience, I might use some tools like React-Native-Interactable and Lottie. </p>\n<p>A bonus that comes with using React Native is that although I only have resources to create an Android app right now, it’s easy to “port” a React Native project over to iOS.</p>\n<h2>Who will this be for?</h2>\n<p>People who struggle with building habits and need an extra push to stick to their newly created habit by giving out instant gratification. This could be people who are busy and need an extra reason to fit something into their day. It could be people who are forgetful about some habits, who need a gentle reminder from the app. Finally, it could be for people who are lazy who need something to motivate them toward forming a habit.</p>\n<h2>What’s the business model?</h2>\n<p>The likely business model would be to charge a small fee (£0.99-£2.99) for unlimited access to the application. There could also be a lite version that limits how many habits or rewards can be created with an in-app purchase to unlock the full version.</p>\n<p>There’s potential to allow users to get the app in the form of a subscription if online features were added such as leaderboards. But I personally hate subscriptions.</p>\n<p>There could also be potential in earning referral revenue from businesses who partner up to offer rewards.</p>","frontmatter":{"title":"The Project Outline","date":"October 04, 2018"}}},"pageContext":{"slug":"/project-outline/","previous":{"fields":{"slug":"/what-is-this/"},"frontmatter":{"title":"Welcome"}},"next":{"fields":{"slug":"/research-plan/"},"frontmatter":{"title":"Research Plan"}}}}