{"data":{"site":{"siteMetadata":{"title":"Final Year Research Log","author":"William Park"}},"markdownRemark":{"id":"e8231900-b7d4-55ef-af5a-41a384e1afe2","excerpt":"Project Overview Some people are creatures by habit, and some people struggle to keep habits. A habit, by definition, is something that you…","html":"<h2>Project Overview</h2>\n<p>Some people are creatures by habit, and some people struggle to keep habits. A habit, by definition, is something that you do often and regularly. This means forming a habit is no easy task without repeated focus. The problem is this repeated focus to build a habit can be hard to keep if you’re forgetful, busy, or even lazy.</p>\n<p>This app will aim to use gamification hooks to pull people back to the repeated focus of creating their habit until the habit exists and fuels itself. Currently, my idea involves users earning virtual currency (but not crypto!) for keeping to their habits and spending that currency on rewards that users set up themselves. (But there’s no reason this couldn’t be expanded later to allow users to earn real rewards, like <a href=\"https://itunes.apple.com/gb/app/sweatcoin-sweat-for-coin/id971023427?mt=8\">Sweatcoin</a>). For example, if you kept to your diet habit 6 days a week, on the 7th day you can unlock a reward that allows you to treat yourself to a take-away. Of course, you could buy a take-away without that - but shame on that user!</p>\n<h3>Pros:</h3>\n<ul>\n<li>It will be interesting to apply gamification techniques to something that isn’t really a game.</li>\n<li>It’s something that would help drive me personally. And I’m sure could help other people.</li>\n<li>The potential to grow the idea into something like Sweatcoin, where you partner with businesses to offer rewards.</li>\n<li>Potential for online interactivity (leaderboards, etc)</li>\n</ul>\n<h3>Cons:</h3>\n<ul>\n<li>Will depend heavily on gamification. If it’s applied wrong, the app will fail.</li>\n<li>Has been done before. See <a href=\"https://habitica.com/\">Habitica</a>, but I personally think it’s really heavy handed with turning habits into a game and I think there’s potential in simplifying this idea.</li>\n<li>Useful on mobile, but only have resources to create on Android.</li>\n</ul>","frontmatter":{"title":"The Project Outline","date":"October 04, 2018"}}},"pageContext":{"slug":"/project-outline/","previous":{"fields":{"slug":"/what-is-this/"},"frontmatter":{"title":"Welcome"}},"next":null}}